app/views/courses/index.html.erb

        <td><%= course.name %></td>
        <td><%= pluralize(course.votes.count, "votes") %></td>
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."course_id" = ?  [["course_id", 2]]