app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
    flash[:alert] = "早安！你好！"
    flash[:warning] = "警告你"
    @categories = Category.all