app/controllers/courses_controller.rb

INSERT INTO "votes" ("course_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["course_id", 2], ["created_at", "2017-04-01 09:05:55.023930"], ["updated_at", "2017-04-01 09:05:55.023930"]]
---
  def upvotes
    @course.votes.create

DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 4]]
SELECT  "votes".* FROM "votes" WHERE "votes"."course_id" = ?  ORDER BY "votes"."id" ASC LIMIT 1  [["course_id", 2]]
---
  def downvotes
    @course.votes.take.destroy

INSERT INTO "courses" ("name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "语文"], ["content", "唐诗"], ["created_at", "2017-04-01 07:10:26.531287"], ["updated_at", "2017-04-01 07:10:26.531287"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save