app/controllers/votes_controller.rb

  def index
    @votes = Vote.all
---
SELECT "votes".* FROM "votes"

  def create
    @vote = Vote.new(vote_params)

    respond_to do |format|
      if @vote.save
---
INSERT INTO "votes" ("course_id", "count", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["course_id", 1], ["count", 21], ["created_at", "2017-04-01 07:11:30.080100"], ["updated_at", "2017-04-01 07:11:30.080100"]]

    def set_vote
      @vote = Vote.find(params[:id])
---
SELECT  "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", 1]]